balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128GP708.PIC
      <edc:DCRDef edc:access="nnnnnnnnnn--nnnn" edc:cname="FSS" edc:default="0xff" edc:desc="" edc:impl="0xffcf" edc:name="FSS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xcf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SWRP" edc:desc="Secure Segment Program Write Protect" edc:mask="0x1" edc:name="SWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_OFF" edc:codeguardidref="PgmSecureWrtProtectOff" edc:desc="Secure Segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_ON" edc:codeguardidref="PgmSecureWrtProtectOn" edc:desc="Secure segment is write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SSS" edc:desc="Secure Segment Program Flash Memory Code Protection" edc:mask="0x7" edc:name="SSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_FLASH" edc:codeguardidref="PgmSecureNone" edc:desc="No Secure Segment" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="NO_SEC_CODE" edc:codeguardidref="NoSecCode" edc:desc="No Secure Segment" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_STD" edc:codeguardidref="PgmSecureStdSm" edc:desc="Standard Security, Small-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_SEC_CODE" edc:codeguardidref="StdSmSecCode" edc:desc="Standard Security, Small-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_STD" edc:codeguardidref="PgmSecureStdMed" edc:desc="Standard Security, Medium-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="STRD_MEDIUM_SEC_CODE" edc:codeguardidref="StdMedSecCode" edc:desc="Standard Security, Medium-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_STD" edc:codeguardidref="PgmSecureStdLarge" edc:desc="Standard Security, Large-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="STRD_LARGE_SEC_CODE" edc:codeguardidref="StdLarSecCode" edc:desc="Standard Security, Large-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="" edc:desc="No Secure Segment" edc:islanghidden="true" edc:when="(field &amp; 0x7) == 0x3" edcisidehidden="true"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_HIGH" edc:codeguardidref="PgmSecureHighSm" edc:desc="High Security, Small-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_SEC_CODE" edc:codeguardidref="HiSmSecCode" edc:desc="High Security, Small-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_HIGH" edc:codeguardidref="PgmSecureHighMed" edc:desc="High Security, Medium-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_SEC_CODE" edc:codeguardidref="HiMedSecCode" edc:desc="High Security, Medium-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_HIGH" edc:codeguardidref="PgmSecureHighLarge" edc:desc="High Security, Large-sized Secure Flash" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_LARGE_SEC_CODE" edc:codeguardidref="HiLarSecCode" edc:desc="High Security, Large-sized Secure Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RSS" edc:desc="Secure Segment Data RAM Protection" edc:mask="0x3" edc:name="RSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NO_RAM" edc:codeguardidref="DataSecureNone" edc:desc="No Secure RAM" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NO_SEC_RAM" edc:codeguardidref="NoSecRam" edc:desc="No Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_RAM" edc:codeguardidref="DataSecureSmall" edc:desc="Small-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_SEC_RAM" edc:codeguardidref="SmallSecRam" edc:desc="Small-sized Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_RAM" edc:codeguardidref="DataSecureMed" edc:desc="Medium-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_SEC_RAM" edc:codeguardidref="MedSecRam" edc:desc="Medium-sized Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_RAM" edc:codeguardidref="DataSecureLarge" edc:desc="Large-sized Secure RAM" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_SEC_RAM" edc:codeguardidref="LarSecRam" edc:desc="Large-sized Secure RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES" edc:desc="Reserved" edc:ishidden="true" edc:mask="0xff" edc:name="RES" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Reserved" edc:when="(field &amp; 0x0) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FGS" edc:default="0xffff" edc:desc="" edc:impl="0x7" edc:name="FGS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="User program memory is not write-protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="User program memory is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GSS" edc:desc="General Segment Code Protection" edc:mask="0x3" edc:name="GSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenNone" edc:desc="User program memory is not code-protected" edc:when="(field &amp; 0x3) == 0x3">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_OFF"/>
                  <edc:LegacyAlias edc:cname="GCP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenStd" edc:desc="Standard Security Code Protection is Enabled" edc:when="(field &amp; 0x3) == 0x2">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x15800"/>
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_STD"/>
                  <edc:LegacyAlias edc:cname="GCP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:codeguardidref="PgmGenHigh" edc:desc="High Security Code Protection is Enabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x15800"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------n-n--nnn" edc:cname="FOSCSEL" edc:default="0xffff" edc:desc="" edc:impl="0xa7" edc:name="FOSCSEL" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xa7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Mode" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="LPRCDIVN" edc:desc="Internal Fast RC (FRC) with divide by N" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="FRCDIV16" edc:desc="Internal Fast RC (FRC) divide by 16" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary Oscillator (XT, HS, EC) w/ PLL" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Internal Fast RC (FRC) w/ PLL" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="TEMP" edc:desc="Temperature Protection Enable" edc:ishidden="true" edc:mask="0x1" edc:name="TEMP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Temperature protection disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Temperature protection enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Two-speed Oscillator Start-Up Enable" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Start up with FRC, then switch" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Start up with user-selected oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nn---nnn" edc:cname="FOSC" edc:default="0xffff" edc:desc="" edc:impl="0xc7" edc:name="FOSC" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMD" edc:desc="Primary Oscillator Source" edc:mask="0x3" edc:name="POSCMD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary Oscillator Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Oscillator Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT Oscillator Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC Oscillator Mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="OSC2 Pin Function" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSC2 pin has clock out function" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSC2 pin has digital I/O function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Both Clock Switching and Fail-Safe Clock Monitor are disabled" edc:when="(field &amp; 0x2) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Both Clock Switching and Fail-Safe Clock Monitor are enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
